## SELECT THE DATA FROM EXCEL SHEET AND COPY IT TO THE CLIPBOARD

In [5]:
import pandas as pd

In [7]:
df=pd.read_clipboard()

In [9]:
df

   Column A  Column B Column C
0         1       4.4    seven
1         2       5.5    eight
2         3       6.6     nine

In [8]:
df.dtypes

Column A      int64
Column B    float64
Column C     object
dtype: object

In [16]:
df1=pd.read_clipboard()

In [17]:
df1

         Left  Right
Alice      10     40
Bob        20     50
Charlie    30     60